# Валидные данные для авторизации
valid_email = 'valesa@mail.ru'
valid_password = '123456789'
# ------------------------------------------------------------------------------------------------

# Не валидные данные для авторизации
invalid_email = 'valesast@mail.ru'
invalid_password = '987654321'
invalid_auth_key = {
  "key": "ea738148a1f19838e1c3558866e733e877b0ae729"
}
rotten_auth_key = {
  "key": "ea738148a1f19838e1r4s2343877f3691a3731380e733e877b0ae72"
}
# -----------------------------------------------------------------------------------------------


# Данные для добавления питомца
add_name = 'Котофей'
add_age = '1'
add_animal_type = 'Кошка'
add_pet_photo = 'images/cat1.jpg'
# -----------------------------------------------------------------------------------------------

# Данные для обновления информации о питомце
update_name = 'Утёнок'
update_age = '3'
update_animal_type = 'Утка'
update_pet_photo = 'images/cat2.jpeg'
# ----------------------------------------------------------------------------------------------


def generate_string(num):
    return "x" * num


def russian_chars():
    return 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя'


def chinese_chars():
    return '的一是不了人我在有他这为之大来以个中上们'


def special_chars():
    return '|\\/!@#$%^&*()-_=+`~?"№;:[]{}'





